"""
Выбрать систему, которая может быть описана несколькими классами.
Описать исползуя классы и применить принципы ООП:
- Наследование
- Абстрактные классы и/или интерфейсы
- Сокрытие
- Инкапсуляция
У классов должно быть состояние (поля) и реализация поведения через методы.
Требований к типам полей (экземпляра/класса) и методов (экземпляра/класса/статические) нет, по необходимости как вы видите.
Написать код который создает необходимые экземпляры и демонстрирует работу систему.
Ограничений на количество классов нет, но конечно их тут будет не пара.
Это задание на это и следующие занятие. Пока советую выбрать систему, и порисовать из чего она состоит.
"""
#--------------------------------------------------------------------------------------------------------------
